In [2]:
%load_ext sql
%config SqlMagic.style = 'DEFAULT'

%sql mysql+pymysql://root:yourdbpassword@localhost:3306/databasename

In [7]:
%%sql
drop table  if exists sales;
CREATE TABLE sales (
    Invoice_ID VARCHAR(20) PRIMARY KEY,
    Branch CHAR(1),                    
    City VARCHAR(50),                     
    Customer_type VARCHAR(10),       
    Gender VARCHAR(10),                  
    Product_line VARCHAR(100),        
    Unit_price DECIMAL(10,2),      
    Quantity INT,                         
    Tax_5 DECIMAL(10,2),                
    Total DECIMAL(10,2),               
    Date DATE,                          
    Time TIME,                         
    Payment VARCHAR(20),              
    COGS DECIMAL(10,2),                  
    Gross_margin_percentage DECIMAL(5,2), 
    Gross_income DECIMAL(10,2),         
    Rating DECIMAL(3,1)                   
);

 * mysql+pymysql://root:***@localhost:3306/Amazon
0 rows affected.
0 rows affected.

[]

In [ ]:
import pandas as pd
from sqlalchemy import create_engine

# 1. Read CSV file into pandas
df = pd.read_csv("WalmartSalesData.csv")

# 2. Make sure column names in CSV match your table definition exactly
#    (rename if needed)
df.rename(columns={
    "Invoice ID": "Invoice_ID",
    "Branch": "Branch",
    "City": "City",
    "Customer type": "Customer_type",
    "Gender": "Gender",
    "Product line": "Product_line",
    "Unit price": "Unit_price",
    "Quantity": "Quantity",
    "Tax 5%": "Tax_5",
    "Total": "Total",
    "Date": "Date",
    "Time": "Time",
    "Payment": "Payment",
    "cogs": "COGS",
    "gross margin percentage": "Gross_margin_percentage",
    "gross income": "Gross_income",
    "Rating": "Rating"
}, inplace=True)

# 3. Connect to MySQL (update username, password, db name)
engine = create_engine("mysql+mysqlconnector://root:root@localhost:3306/your_database")

# 4. Insert into the sales table
df.to_sql("sales", con=engine, if_exists="append", index=False)

print("Data inserted successfully!")

In [21]:
%%sql
select * from sales limit 1;

 * mysql+pymysql://root:***@localhost:3306/Amazon
1 rows affected.

[('750-67-8428', 'A', 'Yangon', 'Member', 'Female', 'Health and beauty', 74.69, 7, 26.1415, 548.9715, '2019-01-05', '13:08:00', 'Ewallet', 522.83, Decimal('4.76'), 26.1415, 9.1)]

### Q1: What is the total revenue generated by the store?

In [25]:
%%sql
select Branch, round(SUM(Total),0) AS Total_Revenue
FROM sales
GROUP BY Branch order by branch;

 * mysql+pymysql://root:***@localhost:3306/Amazon
3 rows affected.

[('A', 106200.0), ('B', 106198.0), ('C', 110569.0)]

### Q2: Which branch (A, B, C) generates the highest revenue?

In [27]:
%%sql
select branch,round(sum(total),0) as highest_revenue from sales group by branch order by highest_revenue desc limit 1;

 * mysql+pymysql://root:***@localhost:3306/Amazon
1 rows affected.

[('C', 110569.0)]

### Q3: What are the top 5 product lines by total sales revenue?

In [43]:
%%sql 
SELECT Product_line,round(SUM(Total),0) AS total_amount
FROM sales
GROUP BY Product_line
ORDER BY total_amount DESC
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/Amazon
5 rows affected.

[('Food and beverages', 56145.0),
 ('Sports and travel', 55123.0),
 ('Electronic accessories', 54338.0),
 ('Fashion accessories', 54306.0),
 ('Home and lifestyle', 53862.0)]

### Q4: Which payment method is most frequently used?

In [44]:
%%sql 
select payment,count(*) as total_count from sales
group by payment
order by total_count desc;

 * mysql+pymysql://root:***@localhost:3306/Amazon
3 rows affected.

[('Ewallet', 345), ('Cash', 344), ('Credit card', 311)]

In [46]:
%%sql 
select customer_type,format(avg(total),2) as average from sales group by customer_type;

 * mysql+pymysql://root:***@localhost:3306/Amazon
2 rows affected.

[('Member', '327.79'), ('Normal', '318.12')]

### Q5: Which product line + city combination should Walmart prioritize for promotions (high sales + high ratings)?

In [17]:
%%sql
select 
    product_line,
        city,round(sum(total),0) as amount,
                    round(avg(rating),0) as avg_rating 
                          from sales group by city,product_line order by amount desc,avg_rating desc limit 1;

 * mysql+pymysql://root:***@localhost:3306/Amazon
1 rows affected.

[('Food and beverages', 'Naypyitaw', 23767.0, 7.0)]

### Q6:	Which gender spends more on average?

In [50]:
%%sql
select Gender,format(avg(total),2) as average from sales group by Gender order by average desc limit 1;

 * mysql+pymysql://root:***@localhost:3306/Amazon
1 rows affected.

[('Female', '335.10')]

### Q7:	What is the most popular product line among male vs female customer?

In [70]:
%%sql
select gender,product_line,total 
from (select gender,product_line,count(*) as total,
rank() over (partition by gender order by count(*))
as rnk
 from sales group by gender,product_line) as ranked where rnk = 1;

 * mysql+pymysql://root:***@localhost:3306/Amazon
2 rows affected.

[('Female', 'Health and beauty', 64), ('Male', 'Sports and travel', 78)]

### Q8:	What is the average rating given by customers for each product line?

In [74]:
%%sql
select product_line,format(avg(Rating),1) as rating from sales
group by product_line order by rating desc ;

 * mysql+pymysql://root:***@localhost:3306/Amazon
6 rows affected.

[('Food and beverages', '7.1'),
 ('Health and beauty', '7.0'),
 ('Fashion accessories', '7.0'),
 ('Electronic accessories', '6.9'),
 ('Sports and travel', '6.9'),
 ('Home and lifestyle', '6.8')]

###  Q9: how many unique customers visited each branch?

In [97]:
%%sql
select branch,count(distinct(`Invoice_Id`))as unique_customer from sales group by branch;

 * mysql+pymysql://root:***@localhost:3306/Amazon
3 rows affected.

[('A', 340), ('B', 332), ('C', 328)]

### Q10.	What is the daily sales trend (total sales per day)?

In [99]:
%%sql 
select Date,format(sum(total),2) from sales group by Date order by Date;

 * mysql+pymysql://root:***@localhost:3306/Amazon
89 rows affected.

[('2019-01-01', '4,745.18'),
 ('2019-01-02', '1,945.50'),
 ('2019-01-03', '2,078.13'),
 ('2019-01-04', '1,623.69'),
 ('2019-01-05', '3,536.68'),
 ('2019-01-06', '3,614.20'),
 ('2019-01-07', '2,834.24'),
 ('2019-01-08', '5,293.73'),
 ('2019-01-09', '3,021.34'),
 ('2019-01-10', '3,560.95'),
 ('2019-01-11', '2,114.96'),
 ('2019-01-12', '5,184.76'),
 ('2019-01-13', '2,451.20'),
 ('2019-01-14', '3,966.62'),
 ('2019-01-15', '5,944.26'),
 ('2019-01-16', '4,289.08'),
 ('2019-01-17', '3,142.76'),
 ('2019-01-18', '2,780.47'),
 ('2019-01-19', '4,914.72'),
 ('2019-01-20', '3,655.45'),
 ('2019-01-21', '2,392.10'),
 ('2019-01-22', '1,704.77'),
 ('2019-01-23', '5,994.19'),
 ('2019-01-24', '5,402.05'),
 ('2019-01-25', '4,700.37'),
 ('2019-01-26', '4,457.51'),
 ('2019-01-27', '4,635.90'),
 ('2019-01-28', '4,999.71'),
 ('2019-01-29', '3,516.57'),
 ('2019-01-30', '2,558.26'),
 ('2019-01-31', '5,232.50'),
 ('2019-02-01', '2,444.54'),
 ('2019-02-02', '4,140.95'),
 ('2019-02-03', '5,467.93'),
 ('2019-02-04', '2,439.50'),
 ('2019-02-05', '3,031.13'),
 ('2019-02-06', '2,905.42'),
 ('2019-02-07', '7,228.21'),
 ('2019-02-08', '5,084.66'),
 ('2019-02-09', '3,271.89'),
 ('2019-02-10', '3,141.02'),
 ('2019-02-11', '4,542.15'),
 ('2019-02-12', '2,998.99'),
 ('2019-02-13', '934.24'),
 ('2019-02-14', '2,454.09'),
 ('2019-02-15', '6,830.79'),
 ('2019-02-16', '2,503.77'),
 ('2019-02-17', '5,299.57'),
 ('2019-02-18', '1,496.03'),
 ('2019-02-19', '4,228.12'),
 ('2019-02-20', '2,706.42'),
 ('2019-02-21', '1,393.74'),
 ('2019-02-22', '2,442.31'),
 ('2019-02-23', '2,339.59'),
 ('2019-02-24', '2,722.46'),
 ('2019-02-25', '4,807.24'),
 ('2019-02-26', '2,408.16'),
 ('2019-02-27', '5,859.45'),
 ('2019-02-28', '2,097.02'),
 ('2019-03-01', '2,634.37'),
 ('2019-03-02', '6,560.31'),
 ('2019-03-03', '4,853.17'),
 ('2019-03-04', '3,894.44'),
 ('2019-03-05', '6,230.88'),
 ('2019-03-06', '3,092.60'),
 ('2019-03-07', '1,438.26'),
 ('2019-03-08', '3,125.39'),
 ('2019-03-09', '7,474.05'),
 ('2019-03-10', '3,163.23'),
 ('2019-03-11', '2,961.25'),
 ('2019-03-12', '3,677.55'),
 ('2019-03-13', '2,063.61'),
 ('2019-03-14', '7,214.63'),
 ('2019-03-15', '2,942.42'),
 ('2019-03-16', '3,154.47'),
 ('2019-03-17', '1,976.29'),
 ('2019-03-18', '1,292.83'),
 ('2019-03-19', '5,740.39'),
 ('2019-03-20', '5,458.20'),
 ('2019-03-21', '1,877.52'),
 ('2019-03-22', '3,179.15'),
 ('2019-03-23', '4,095.04'),
 ('2019-03-24', '3,477.46'),
 ('2019-03-25', '2,272.97'),
 ('2019-03-26', '1,962.51'),
 ('2019-03-27', '2,902.82'),
 ('2019-03-28', '2,229.40'),
 ('2019-03-29', '4,023.24'),
 ('2019-03-30', '4,487.06')]

### Q11: Which month had the highest total revenue?

In [104]:
%%sql 
select date_format(Date,'%M') as order_month,format(sum(total),2) as total_sales from sales
group by order_month
order by total_sales desc limit 1;

 * mysql+pymysql://root:***@localhost:3306/Amazon
1 rows affected.

[('February', '97,219.37')]

### Q12. What are the peak sales hours during the day?

In [105]:
%%sql
select HOUR(Time) AS Hour, 
       SUM(Total) AS Sales, 
       COUNT(*) AS Transactions
FROM sales
group by  HOUR(Time)
order by Sales DESC;

 * mysql+pymysql://root:***@localhost:3306/Amazon
11 rows affected.

[(19, 39699.51300000002, 113),
 (13, 34723.22700000001, 103),
 (10, 31421.48100000001, 101),
 (15, 31179.508499999996, 102),
 (14, 30828.399, 83),
 (11, 30377.329499999996, 90),
 (12, 26065.882499999996, 89),
 (18, 26030.339999999986, 93),
 (16, 25226.323499999995, 77),
 (17, 24445.218, 74),
 (20, 22969.527000000002, 75)]

### Q13: On which day of the week do branches generate the most sales?

In [111]:
%%sql
select dayname(Date) as day,format(sum(total),2) as total from sales
group by day order by total desc;

 * mysql+pymysql://root:***@localhost:3306/Amazon
7 rows affected.

[('Saturday', '56,120.81'),
 ('Tuesday', '51,482.25'),
 ('Thursday', '45,349.25'),
 ('Sunday', '44,457.89'),
 ('Friday', '43,926.34'),
 ('Wednesday', '43,731.14'),
 ('Monday', '37,899.08')]

### Q14: What percentage of total revenue is contributed by the top 3 product lines?

In [123]:
%%sql
with perc as (select product_line,round((product_total/(select sum(total) from sales))*100,2) as percentage
from (select product_line,sum(total) as product_total from sales
group by product_line order by product_total desc limit 3) as tp_3 )
select concat(sum(percentage),'%')as total_revenue from perc;

 * mysql+pymysql://root:***@localhost:3306/Amazon
1 rows affected.

[('51.27%',)]

In [20]:
### Q15: Which Branch with most consistent monthly sales (lowest variance)

In [126]:
%%sql
select Branch, variance(Monthly_Sales) AS Sales_Variance
from (
    select Branch, DATE_FORMAT(Date, '%Y-%m') AS YearMonth, SUM(Total) AS Monthly_Sales
    FROM sales
    GROUP BY Branch, YearMonth
) AS monthly_sales
GROUP BY Branch
ORDER BY Sales_Variance ASC
LIMIT 1;

 * mysql+pymysql://root:***@localhost:3306/Amazon
1 rows affected.

[('B', 1583562.710880521)]

### Q16: How much tax revenue does each branch generate, and which branch contributes the most to Walmart’s overall tax collection?

In [19]:
%%sql
SELECT 
    Branch,
    ROUND(SUM(`Tax 5%`), 2) AS Total_Tax,
    ROUND(SUM(`Tax 5%`) / (SELECT SUM(`Tax 5%`) FROM sales) * 100, 2) AS Tax_Percentage
FROM sales
GROUP BY Branch
ORDER BY Total_Tax DESC;

 * mysql+pymysql://root:***@localhost:3306/Amazon
3 rows affected.

[('C', 5265.18, 34.24), ('A', 5057.16, 32.88), ('B', 5057.03, 32.88)]